Using names.txt (right click and 'Save Link/Target As...'), a 46K text file containing over five-thousand first names, begin by sorting it into alphabetical order. Then working out the alphabetical value for each name, multiply this value by its alphabetical position in the list to obtain a name score.

For example, when the list is sorted into alphabetical order, COLIN, which is worth 3 + 15 + 12 + 9 + 14 = 53, is the 938th name in the list. So, COLIN would obtain a score of 938 × 53 = 49714.

What is the total of all the name scores in the file?

In [3]:
import numpy as np
import pandas as pd

In [4]:
!ls

10.ipynb  12.ipynb  15.ipynb  18.ipynb	21.ipynb  5.ipynb  9.ipynb
11.csv	  13.ipynb  16.ipynb  19.ipynb	22.ipynb  7.ipynb  p022_names.txt
11.ipynb  14.ipynb  17.ipynb  20.ipynb	4.ipynb   8.ipynb

In [45]:
# Load data into the correct format
data = pd.read_csv("p022_names.txt").columns.to_numpy()
data = pd.DataFrame(data)
data = data.rename({0: 'name'}, axis=1)
data

           name
0          MARY
1      PATRICIA
2         LINDA
3       BARBARA
4     ELIZABETH
...         ...
5158      ELDEN
5159     DORSEY
5160     DARELL
5161  BRODERICK
5162     ALONSO

[5163 rows x 1 columns]

In [46]:
# sort and make index be the multiplication values
data = data.sort_values(['name'])
data = data.reset_index(drop=True)
data.index += 1
data

         name
1       AARON
2       ABBEY
3       ABBIE
4        ABBY
5       ABDUL
...       ...
5159     ZORA
5160  ZORAIDA
5161     ZULA
5162   ZULEMA
5163    ZULMA

[5163 rows x 1 columns]

In [80]:
letter_vals = {'A': 1,
              'B': 2,
              'C': 3,
              'D': 4,
              'E': 5,
              'F': 6,
              'G': 7,
              'H': 8,
              'I': 9,
              'J': 10,
              'K': 11,
              'L': 12,
              'M': 13,
              'N': 14,
              'O': 15,
              'P': 16,
              'Q': 17,
              'R': 18,
              'S': 19,
              'T': 20,
              'U': 21,
              'V': 22,
              'W': 23,
              'X': 24,
              'Y': 25,
              'Z': 26}


def calc_name_value(name):
    sum = 0
    for letter in name:
        sum += letter_vals[letter]
    return sum


data['value'] = np.nan
for i, row in data.iterrows():
    data.loc[i, "value"] = calc_name_value(row[0]) * i

In [82]:
data.value.sum()

871198282.0